app/views/lists/show.html.erb

SELECT  "images".* FROM "images" WHERE "images"."page_id" = ?  ORDER BY "images"."id" ASC LIMIT 1  [["page_id", 1]]
---
	<% @pages.each do |page| %>
		<% page.images.each do |image| %>