app/controllers/lists_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @list = List.find_by(id: params[:id])

INSERT INTO "pages" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)
INSERT INTO "images" ("url", "created_at", "updated_at") VALUES (?, ?, ?)  [["url", "http://images.craigslist.org/00L0L_bfSRN4MeVj6_600x450.jpg"], ["created_at", "2015-09-24 11:13:08.794016"], ["updated_at", "2015-09-24 11:13:08.794016"]]
INSERT INTO "lists" ("title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test List"], ["url", "http://sfbay.craigslist.org/search/sfc/zip"], ["created_at", "2015-09-24 11:00:14.762220"], ["updated_at", "2015-09-24 11:00:14.762220"]]
UPDATE "images" SET "page_id" = ?, "updated_at" = ? WHERE "images"."id" = ?  [["page_id", 1], ["updated_at", "2015-09-24 11:13:08.939337"], ["id", 1]]
UPDATE "pages" SET "list_id" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["list_id", 4], ["updated_at", "2015-09-24 11:13:09.140824"], ["id", 1]]
---
  def create
    @list = List.new(list_params)

    links = gather_links(@list.url)

    posts = archive_posts(links)

    posts.each do |post|
      new_page = Page.create(title: post[:title],
                              body:  post[:text])
      post[:images].each do |url|
        new_page.images << Image.create(url: url)
      end

      @list.pages << new_page

      new_page.save